; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		n r o e i u c h g t s - block
	)
	(:init
		(handempty)
		(clear g)
		(on g s)
		(on s o)
		(on o e)
		(ontable e)
		(clear h)
		(on h n)
		(on n i)
		(ontable i)
		(clear t)
		(on t r)
		(on r u)
		(ontable u)
		(clear c)
		(ontable c)
	)
	(:goal (and
		;; rough
		(clear r) (ontable h) (on r o) (on o u) (on u g) (on g h)
	))
)

; plan
1. (unstack h n)
   deleted: (clear h) (handempty) (on h n)
   added: (holding h) (clear n)
   goals met: 0 of 6
2. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 1 of 6
3. (unstack g s)
   deleted: (clear g) (handempty) (on g s)
   added: (holding g) (clear s)
   goals met: 1 of 6
4. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 2 of 6
5. (unstack t r)
   deleted: (clear t) (handempty) (on t r)
   added: (holding t) (clear r)
   goals met: 3 of 6
6. (stack t n)
   deleted: (holding t) (clear n)
   added: (clear t) (handempty) (on t n)
   goals met: 3 of 6
7. (unstack r u)
   deleted: (clear r) (handempty) (on r u)
   added: (holding r) (clear u)
   goals met: 2 of 6
8. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 3 of 6
9. (pick-up u)
   deleted: (ontable u) (clear u) (handempty)
   added: (holding u)
   goals met: 3 of 6
10. (stack u g)
   deleted: (holding u) (clear g)
   added: (clear u) (handempty) (on u g)
   goals met: 4 of 6
11. (unstack s o)
   deleted: (clear s) (handempty) (on s o)
   added: (holding s) (clear o)
   goals met: 4 of 6
12. (stack s t)
   deleted: (holding s) (clear t)
   added: (clear s) (handempty) (on s t)
   goals met: 4 of 6
13. (unstack o e)
   deleted: (clear o) (handempty) (on o e)
   added: (holding o) (clear e)
   goals met: 4 of 6
14. (stack o u)
   deleted: (holding o) (clear u)
   added: (clear o) (handempty) (on o u)
   goals met: 5 of 6
15. (unstack r c)
   deleted: (clear r) (handempty) (on r c)
   added: (holding r) (clear c)
   goals met: 4 of 6
16. (stack r o)
   deleted: (holding r) (clear o)
   added: (clear r) (handempty) (on r o)
   goals met: 6 of 6
